Revit 2027 API
Space.ConditionType Property
Get or set the Condition type of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConditionType ConditionType { get; set; }
Public Property ConditionType As ConditionType
	Get
	Set
public:
property ConditionType ConditionType {
	ConditionType get ();
	void set (ConditionType value);
}
member ConditionType : ConditionType with get, set
Property Value
ConditionType
Remarks
This property is used to get or set the Condition type of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace